<h3>Pivot Table</h3>

In [1]:
import numpy as np
import pandas as pd

In [3]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    730     15   John  January      Q1
1  2023-01-02       B   West    291     70   Mary  January      Q1
2  2023-01-03       C  North    630     65    Bob  January      Q1
3  2023-01-04       D  South    278     74  Alice  January      Q1
4  2023-01-05       A   East    510     21   John  January      Q1
5  2023-01-06       B   West    555     33   Mary  January      Q1
6  2023-01-07       C  North    357     12    Bob  January      Q1
7  2023-01-08       D  South    939     22  Alice  January      Q1
8  2023-01-09       A   East    529     83   John  January      Q1
9  2023-01-10       B   West    957     88   Mary  January      Q1
10 2023-01-11       C  North    441     92    Bob  January      Q1
11 2023-01-12       D  South    265     52  Alice  January      Q1
12 2023-01-13       A   East    620     17   John  January      Q1
13 2023-01-14       B   West    289     64   Mary  January      Q1
14 2023-01-15       C  North    985     13    Bob  January      Q1
15 2023-01-16       D  South    116     84  Alice  January      Q1
16 2023-01-17       A   East    500     81   John  January      Q1
17 2023-01-18       B   West    902     52   Mary  January      Q1
18 2023-01-19       C  North    640     30    Bob  January      Q1
19 2023-01-20       D  South    983     41  Alice  January      Q1

In [4]:
pd.pivot_table(df,values="Sales",index="Region",columns="Product")

Product      A      B      C      D
Region
East     577.8    NaN    NaN    NaN
North      NaN    NaN  610.6    NaN
South      NaN    NaN    NaN  516.2
West       NaN  598.8    NaN    NaN

In [6]:
pd.pivot_table(df,values=["Sales","Units"],index="Region",columns="Product",aggfunc="sum")

          Sales                          Units
Product       A       B       C       D      A      B      C      D
Region
East     2889.0     NaN     NaN     NaN  217.0    NaN    NaN    NaN
North       NaN     NaN  3053.0     NaN    NaN    NaN  212.0    NaN
South       NaN     NaN     NaN  2581.0    NaN    NaN    NaN  273.0
West        NaN  2994.0     NaN     NaN    NaN  307.0    NaN    NaN

In [8]:
pd.crosstab(df["Product"],df["Region"])

Region   East  North  South  West
Product
A           5      0      0     0
B           0      0      0     5
C           0      5      0     0
D           0      0      5     0

The End